### Importing libraries

In [590]:
import pandas as pd

### Importing the data frame

In [591]:
df = pd.read_csv("Pizza_sales.csv", index_col=0)
df

,Order_ID,Customer,Order_Date,Pizza_Type,Size,Branch,Quantity,Price,Sales
0,1001,Amaya,2024/05/08,Veggie,L,Colombo,4,1900,7600
1,1002,Sajantha,29-01-2024,Margherita,M,Galle,2,1300,2600
2,1003,Dinura,2024.10.08,Pepperoni,L,Kandy,2,2000,4000
3,1004,Dinura,2024.10.24,Pepperoni,L,Kandy,3,2000,6000
4,1005,Dinura,2024-10-12,Pepperoni,L,Kandy,2,2000,4000
...,...,...,...,...,...,...,...,...,...
95,1096,Sajantha,11-01-2024,Margherita,M,Galle,2,1300,2600
96,1097,Dinura,2024/10/20,Pepperoni,L,Kandy,5,2000,10000
97,1098,Kasun,2024/02/16,Pepperoni,M,Colombo,5,1500,7500
98,1099,Dinura,05-10-2024,Pepperoni,L,Kandy,3,2000,6000
99,1100,Dilshan,2024-07-04,Veggie,S,Kandy,4,900,3600

### Examining the data frame

In [592]:
df.dtypes

Order_ID       int64
Customer      object
Order_Date    object
Pizza_Type    object
Size          object
Branch        object
Quantity       int64
Price          int64
Sales          int64
dtype: object

### Step 01

Converting data types

In [593]:
df

,Order_ID,Customer,Order_Date,Pizza_Type,Size,Branch,Quantity,Price,Sales
0,1001,Amaya,2024/05/08,Veggie,L,Colombo,4,1900,7600
1,1002,Sajantha,29-01-2024,Margherita,M,Galle,2,1300,2600
2,1003,Dinura,2024.10.08,Pepperoni,L,Kandy,2,2000,4000
3,1004,Dinura,2024.10.24,Pepperoni,L,Kandy,3,2000,6000
4,1005,Dinura,2024-10-12,Pepperoni,L,Kandy,2,2000,4000
...,...,...,...,...,...,...,...,...,...
95,1096,Sajantha,11-01-2024,Margherita,M,Galle,2,1300,2600
96,1097,Dinura,2024/10/20,Pepperoni,L,Kandy,5,2000,10000
97,1098,Kasun,2024/02/16,Pepperoni,M,Colombo,5,1500,7500
98,1099,Dinura,05-10-2024,Pepperoni,L,Kandy,3,2000,6000
99,1100,Dilshan,2024-07-04,Veggie,S,Kandy,4,900,3600

In [594]:
# Convert Order_Date to datetime
df['Order_Date'] = pd.to_datetime(df['Order_Date'], format='mixed', errors='raise', dayfirst=True)

In [595]:
# Convert Sales to numeric
df['Sales'] = df['Sales'].astype(float)

In [596]:
# 3. Convert to categorical
df['Pizza_Type'] = df['Pizza_Type'].astype('category')
df['Size'] = df['Size'].astype('category')
df['Branch'] = df['Branch'].astype('category')

In [597]:
df

,Order_ID,Customer,Order_Date,Pizza_Type,Size,Branch,Quantity,Price,Sales
0,1001,Amaya,2024-05-08,Veggie,L,Colombo,4,1900,7600.0
1,1002,Sajantha,2024-01-29,Margherita,M,Galle,2,1300,2600.0
2,1003,Dinura,2024-10-08,Pepperoni,L,Kandy,2,2000,4000.0
3,1004,Dinura,2024-10-24,Pepperoni,L,Kandy,3,2000,6000.0
4,1005,Dinura,2024-10-12,Pepperoni,L,Kandy,2,2000,4000.0
...,...,...,...,...,...,...,...,...,...
95,1096,Sajantha,2024-01-11,Margherita,M,Galle,2,1300,2600.0
96,1097,Dinura,2024-10-20,Pepperoni,L,Kandy,5,2000,10000.0
97,1098,Kasun,2024-02-16,Pepperoni,M,Colombo,5,1500,7500.0
98,1099,Dinura,2024-10-05,Pepperoni,L,Kandy,3,2000,6000.0
99,1100,Dilshan,2024-07-04,Veggie,S,Kandy,4,900,3600.0

In [598]:
df.dtypes

Order_ID               int64
Customer              object
Order_Date    datetime64[ns]
Pizza_Type          category
Size                category
Branch              category
Quantity               int64
Price                  int64
Sales                float64
dtype: object

Standardizing text values

In [599]:
df['Pizza_Type'] = df['Pizza_Type'].str.title()
df['Branch'] = df['Branch'].str.upper()

In [600]:
df

,Order_ID,Customer,Order_Date,Pizza_Type,Size,Branch,Quantity,Price,Sales
0,1001,Amaya,2024-05-08,Veggie,L,COLOMBO,4,1900,7600.0
1,1002,Sajantha,2024-01-29,Margherita,M,GALLE,2,1300,2600.0
2,1003,Dinura,2024-10-08,Pepperoni,L,KANDY,2,2000,4000.0
3,1004,Dinura,2024-10-24,Pepperoni,L,KANDY,3,2000,6000.0
4,1005,Dinura,2024-10-12,Pepperoni,L,KANDY,2,2000,4000.0
...,...,...,...,...,...,...,...,...,...
95,1096,Sajantha,2024-01-11,Margherita,M,GALLE,2,1300,2600.0
96,1097,Dinura,2024-10-20,Pepperoni,L,KANDY,5,2000,10000.0
97,1098,Kasun,2024-02-16,Pepperoni,M,COLOMBO,5,1500,7500.0
98,1099,Dinura,2024-10-05,Pepperoni,L,KANDY,3,2000,6000.0
99,1100,Dilshan,2024-07-04,Veggie,S,KANDY,4,900,3600.0

In [601]:
df['Size'].value_counts()

Size
L    46
M    35
S    19
Name: count, dtype: int64

Remapping size

In [602]:
df['Size'] = df['Size'].map({'S': 'Small', 'M': 'Medium', 'L': 'Large'})

In [603]:
df

,Order_ID,Customer,Order_Date,Pizza_Type,Size,Branch,Quantity,Price,Sales
0,1001,Amaya,2024-05-08,Veggie,Large,COLOMBO,4,1900,7600.0
1,1002,Sajantha,2024-01-29,Margherita,Medium,GALLE,2,1300,2600.0
2,1003,Dinura,2024-10-08,Pepperoni,Large,KANDY,2,2000,4000.0
3,1004,Dinura,2024-10-24,Pepperoni,Large,KANDY,3,2000,6000.0
4,1005,Dinura,2024-10-12,Pepperoni,Large,KANDY,2,2000,4000.0
...,...,...,...,...,...,...,...,...,...
95,1096,Sajantha,2024-01-11,Margherita,Medium,GALLE,2,1300,2600.0
96,1097,Dinura,2024-10-20,Pepperoni,Large,KANDY,5,2000,10000.0
97,1098,Kasun,2024-02-16,Pepperoni,Medium,COLOMBO,5,1500,7500.0
98,1099,Dinura,2024-10-05,Pepperoni,Large,KANDY,3,2000,6000.0
99,1100,Dilshan,2024-07-04,Veggie,Small,KANDY,4,900,3600.0

### Step 02

In [604]:
# Renaming columns 
df.rename(columns={'Pizza_Type': 'Topping', 'Order_Date': 'Date'}, inplace=True)

In [605]:
df

,Order_ID,Customer,Date,Topping,Size,Branch,Quantity,Price,Sales
0,1001,Amaya,2024-05-08,Veggie,Large,COLOMBO,4,1900,7600.0
1,1002,Sajantha,2024-01-29,Margherita,Medium,GALLE,2,1300,2600.0
2,1003,Dinura,2024-10-08,Pepperoni,Large,KANDY,2,2000,4000.0
3,1004,Dinura,2024-10-24,Pepperoni,Large,KANDY,3,2000,6000.0
4,1005,Dinura,2024-10-12,Pepperoni,Large,KANDY,2,2000,4000.0
...,...,...,...,...,...,...,...,...,...
95,1096,Sajantha,2024-01-11,Margherita,Medium,GALLE,2,1300,2600.0
96,1097,Dinura,2024-10-20,Pepperoni,Large,KANDY,5,2000,10000.0
97,1098,Kasun,2024-02-16,Pepperoni,Medium,COLOMBO,5,1500,7500.0
98,1099,Dinura,2024-10-05,Pepperoni,Large,KANDY,3,2000,6000.0
99,1100,Dilshan,2024-07-04,Veggie,Small,KANDY,4,900,3600.0

In [606]:
# Reordering the columns
df = df[['Order_ID', 'Date', 'Customer', 'Topping', 'Size', 'Sales', 'Branch']]

In [607]:
#Setting up index
df.set_index('Order_ID', inplace=True)
df.head()

df

               Date  Customer     Topping    Size    Sales   Branch
Order_ID
1001     2024-05-08     Amaya      Veggie   Large   7600.0  COLOMBO
1002     2024-01-29  Sajantha  Margherita  Medium   2600.0    GALLE
1003     2024-10-08    Dinura   Pepperoni   Large   4000.0    KANDY
1004     2024-10-24    Dinura   Pepperoni   Large   6000.0    KANDY
1005     2024-10-12    Dinura   Pepperoni   Large   4000.0    KANDY
...             ...       ...         ...     ...      ...      ...
1096     2024-01-11  Sajantha  Margherita  Medium   2600.0    GALLE
1097     2024-10-20    Dinura   Pepperoni   Large  10000.0    KANDY
1098     2024-02-16     Kasun   Pepperoni  Medium   7500.0  COLOMBO
1099     2024-10-05    Dinura   Pepperoni   Large   6000.0    KANDY
1100     2024-07-04   Dilshan      Veggie   Small   3600.0    KANDY

[100 rows x 6 columns]

In [608]:
# Reset later if needed
df.reset_index(inplace=True)

In [609]:
df

    Order_ID       Date  Customer     Topping    Size    Sales   Branch
0       1001 2024-05-08     Amaya      Veggie   Large   7600.0  COLOMBO
1       1002 2024-01-29  Sajantha  Margherita  Medium   2600.0    GALLE
2       1003 2024-10-08    Dinura   Pepperoni   Large   4000.0    KANDY
3       1004 2024-10-24    Dinura   Pepperoni   Large   6000.0    KANDY
4       1005 2024-10-12    Dinura   Pepperoni   Large   4000.0    KANDY
..       ...        ...       ...         ...     ...      ...      ...
95      1096 2024-01-11  Sajantha  Margherita  Medium   2600.0    GALLE
96      1097 2024-10-20    Dinura   Pepperoni   Large  10000.0    KANDY
97      1098 2024-02-16     Kasun   Pepperoni  Medium   7500.0  COLOMBO
98      1099 2024-10-05    Dinura   Pepperoni   Large   6000.0    KANDY
99      1100 2024-07-04   Dilshan      Veggie   Small   3600.0    KANDY

[100 rows x 7 columns]

### Step 03

In [610]:
# Simple grouping
df.groupby('Branch')['Sales'].sum()

Branch
COLOMBO    241300.0
GALLE       52000.0
KANDY      172600.0
Name: Sales, dtype: float64

In [611]:
# Grouping by multiple variables
df.groupby(['Branch', 'Topping'])['Sales'].mean().reset_index()

    Branch     Topping        Sales
0  COLOMBO   Pepperoni  5181.818182
1  COLOMBO      Veggie  5092.000000
2    GALLE  Margherita  4000.000000
3    KANDY   Pepperoni  5904.761905
4    KANDY      Veggie  2557.894737

In [612]:
df.groupby('Branch').agg({
    'Sales': ['sum', 'mean', 'count']
})

            Sales
              sum         mean count
Branch
COLOMBO  241300.0  5134.042553    47
GALLE     52000.0  4000.000000    13
KANDY    172600.0  4315.000000    40

In [613]:
df.groupby('Branch').agg(
    Total_Sales=('Sales', 'sum'),
    Avg_Sale=('Sales', 'mean'),
    Num_Orders=('Sales', 'count')
).reset_index()

    Branch  Total_Sales     Avg_Sale  Num_Orders
0  COLOMBO     241300.0  5134.042553          47
1    GALLE      52000.0  4000.000000          13
2    KANDY     172600.0  4315.000000          40

### Step 04

In [614]:
# Using pivot_table to handle duplicates
pivot_df = df.pivot_table(
    index='Branch',      # rows
    columns='Topping',   # columns
    values='Sales',      # values to fill
    aggfunc='sum',       # aggregation function for duplicates
    fill_value=0         # optional, fill missing values with 0
)

pivot_df

Topping  Margherita  Pepperoni    Veggie
Branch
COLOMBO         0.0   114000.0  127300.0
GALLE       52000.0        0.0       0.0
KANDY           0.0   124000.0   48600.0

In [615]:
# Melted (long) data frame
melt_df = pd.melt(pivot_df.reset_index(),
                  id_vars=['Branch'],
                  var_name='Topping',
                  value_name='Sales')
melt_df.sort_values(by="Sales", ascending=False)

    Branch     Topping     Sales
6  COLOMBO      Veggie  127300.0
5    KANDY   Pepperoni  124000.0
3  COLOMBO   Pepperoni  114000.0
1    GALLE  Margherita   52000.0
8    KANDY      Veggie   48600.0
0  COLOMBO  Margherita       0.0
2    KANDY  Margherita       0.0
4    GALLE   Pepperoni       0.0
7    GALLE      Veggie       0.0

In [616]:
# Stacked data frame
stacked = pivot_df.stack()
stacked

Branch   Topping
COLOMBO  Margherita         0.0
         Pepperoni     114000.0
         Veggie        127300.0
GALLE    Margherita     52000.0
         Pepperoni          0.0
         Veggie             0.0
KANDY    Margherita         0.0
         Pepperoni     124000.0
         Veggie         48600.0
dtype: float64

In [617]:
# Unstacking again
unstacked = stacked.unstack()
unstacked

Topping  Margherita  Pepperoni    Veggie
Branch
COLOMBO         0.0   114000.0  127300.0
GALLE       52000.0        0.0       0.0
KANDY           0.0   124000.0   48600.0